tutorials/incompressible/pimpleDyMFoam/movingCylinders/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (1 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    firstCyl
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    secondCyl
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    frontIn
    {
        type            ggi;
    }
    frontOut
    {
        type            ggi;
    }
    middleIn
    {
        type            ggi;
    }
    middleOut
    {
        type            ggi;
    }
    backIn
    {
        type            ggi;
    }
    backOut
    {
        type            ggi;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
