tutorials/incompressible/pimpleDyMFoam/movingCylinders/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    firstCyl
    {
        type            zeroGradient;
    }
    secondCyl
    {
        type            zeroGradient;
    }
    frontIn
    {
        type            ggi;
    }
    frontOut
    {
        type            ggi;
    }
    middleIn
    {
        type            ggi;
    }
    middleOut
    {
        type            ggi;
    }
    backIn
    {
        type            ggi;
    }
    backOut
    {
        type            ggi;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
