tutorials/incompressible/pimpleDyMFoam/movingCylinders/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dynamicFvMesh      staticFvMesh;
 dynamicFvMesh      multiTopoBodyFvMesh;

multiTopoBodyFvMeshCoeffs
{
    bodies
    (
        frontCyl
        {
            movingCells     cyl1;
            layerFaces
            (
                topLayerCyl1
                botLayerCyl1
            );

            solidBodyMotionFunction   linearOscillation;
            linearOscillationCoeffs
            {
                amplitude   (0 0.028 0);
                period      2;
            }

            minThickness     0.0015;
            maxThickness     0.004;

            invertMask       true;
        }

        backCyl
        {
            movingCells     cyl2;
            layerFaces
            (
                topLayerCyl2
                botLayerCyl2
            );

            solidBodyMotionFunction   linearOscillation;
            linearOscillationCoeffs
            {
                amplitude   (0 -0.028 0);
                period      3;
            }

            minThickness     0.0015;
            maxThickness     0.004;

            invertMask       true;
        }
    );
}

// ************************************************************************* //
